Revit 2023 API
AreaLoad.Create Method
Overload List
Name | Description
Create(Document, ElementId, XYZ, AreaLoadType)
 Creates a new hosted area load within the project.
Create(Document, IList<CurveLoop>, XYZ, AreaLoadType)
 Creates a new non-hosted area load within the project.
Create(Document, IList<CurveLoop>, IList<XYZ>, IList<Int32>, IList<Int32>, AreaLoadType)
 Creates a new non-hosted area load within the project.
See Also
AreaLoad Class
AreaLoad Members
Autodesk.Revit.DB.Structure Namespace